![ine-divider](https://user-images.githubusercontent.com/7065401/92672068-398e8080-f2ee-11ea-82d6-ad53f7feb5c0.png)
<hr>

### Introduction to Data Science with Python â€” Starter Pass

# Analyzing bank customers with pandas

In this project, you will be using a dataset which contains anonymized bank customer's data to put in practice all the topics you saw on previous lessons.

![bank_customers](https://user-images.githubusercontent.com/7065401/103784823-2af47380-5019-11eb-8054-d766d392d6ff.png)

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Knowing our data

Before starting it's important to load all the libraries we'll be using and understand the data we'll be working on.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('data/bank_customers.csv')

Take a look at some records of your data, analyze columns and values:

In [3]:
df.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Total_Relationship_Count,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct
0,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,5,12691.0,777,1144,42
1,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,6,8256.0,864,1291,33
2,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,4,3418.0,0,1887,20
3,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,3,3313.0,2517,1171,20
4,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,5,4716.0,0,816,28

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10127 entries, 0 to 10126
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Attrition_Flag            10127 non-null  object
 1   Customer_Age              10127 non-null  int64
 2   Gender                    10127 non-null  object
 3   Dependent_count           10127 non-null  int64
 4   Education_Level           10127 non-null  object
 5   Marital_Status            10127 non-null  object
 6   Income_Category           10127 non-null  object
 7   Card_Category             10127 non-null  object
 8   Total_Relationship_Count  10127 non-null  int64
 9   Credit_Limit              10127 non-null  float64
 10  Total_Revolving_Bal       10127 non-null  int64
 11  Total_Trans_Amt           10127 non-null  int64
 12  Total_Trans_Ct            10127 non-null  int64
dtypes: float64(1), int64(6), object(6)
memory usage: 1.0+ MB

In [5]:
df.describe()

,Customer_Age,Dependent_count,Total_Relationship_Count,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct
count,10127.000000,10127.000000,10127.000000,10127.000000,10127.000000,10127.000000,10127.000000
mean,46.325960,2.346203,3.812580,8631.953698,1162.814061,4404.086304,64.858695
std,8.016814,1.298908,1.554408,9088.776650,814.987335,3397.129254,23.472570
min,26.000000,0.000000,1.000000,1438.300000,0.000000,510.000000,10.000000
25%,41.000000,1.000000,3.000000,2555.000000,359.000000,2155.500000,45.000000
50%,46.000000,2.000000,4.000000,4549.000000,1276.000000,3899.000000,67.000000
75%,52.000000,3.000000,5.000000,11067.500000,1784.000000,4741.000000,81.000000
max,73.000000,5.000000,6.000000,34516.000000,2517.000000,18484.000000,139.000000

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## How many customers are within each card category?

In [6]:
df['Card_Category'].value_counts()

Blue        9436
Silver       555
Gold         116
Platinum      20
Name: Card_Category, dtype: int64

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

##Â Remove from the data all the customers without `Blue` cards

In [7]:
df = df.loc[df['Card_Category'] == 'Blue', :]

df.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Total_Relationship_Count,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct
0,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,5,12691.0,777,1144,42
1,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,6,8256.0,864,1291,33
2,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,4,3418.0,0,1887,20
3,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,3,3313.0,2517,1171,20
4,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,5,4716.0,0,816,28

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## How many customers spent more than 10000 USD?

In [8]:
df.loc[df['Total_Trans_Amt'] > 10_000, 'Total_Trans_Amt'].count()

596

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Analyzing total transactions amount

We have the total amount per customer. Let's get the overall average, minimum and maximum amounts:

In [9]:
df['Total_Trans_Amt'].mean()

4225.406740144129

In [10]:
df['Total_Trans_Amt'].max()

18484

In [11]:
df['Total_Trans_Amt'].min()

510

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Calculating average transaction amount per customer

Now let's calculate and add a new column to our dataset called `Avg_Trans_Amt`. To do that we should apply the following formula:

$$ Avg\_Trans\_Amt = \frac{Total\_Trans\_Amt}{Total\_Trans\_Ct} $$

**Can you calculate it?** Round the resulting values to 2 decimals.

In [12]:
df['Avg_Trans_Amt'] = (df['Total_Trans_Amt'] / df['Total_Trans_Ct']).round(2)

df.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Total_Relationship_Count,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct,Avg_Trans_Amt
0,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,5,12691.0,777,1144,42,27.24
1,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,6,8256.0,864,1291,33,39.12
2,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,4,3418.0,0,1887,20,94.35
3,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,3,3313.0,2517,1171,20,58.55
4,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,5,4716.0,0,816,28,29.14

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## What is the overall average transaction amount?

In [13]:
df['Avg_Trans_Amt'].mean()

61.27354599406527

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Replacing Gender values

In the `Gender` column we just have `M` and `F` values. Let's replace them with `Male` and `Female` to better understanding.

> _You can use the `replace()` pandas method to replace certain values._

In [14]:
df['Gender'].value_counts()

F    5101
M    4335
Name: Gender, dtype: int64

In [15]:
genders = {"Gender": {"M": "Male", "F": "Female"}}

df.replace(genders, inplace=True)

df.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Total_Relationship_Count,Credit_Limit,Total_Revolving_Bal,Total_Trans_Amt,Total_Trans_Ct,Avg_Trans_Amt
0,Existing Customer,45,Male,3,High School,Married,$60K - $80K,Blue,5,12691.0,777,1144,42,27.24
1,Existing Customer,49,Female,5,Graduate,Single,Less than $40K,Blue,6,8256.0,864,1291,33,39.12
2,Existing Customer,51,Male,3,Graduate,Married,$80K - $120K,Blue,4,3418.0,0,1887,20,94.35
3,Existing Customer,40,Female,4,High School,Unknown,Less than $40K,Blue,3,3313.0,2517,1171,20,58.55
4,Existing Customer,40,Male,3,Uneducated,Married,$60K - $80K,Blue,5,4716.0,0,816,28,29.14

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Which is the average transactions count per marital status?

Sort the results in ascending order.

In [16]:
df.groupby('Marital_Status')['Total_Trans_Ct'].mean().sort_values()

Marital_Status
Married     60.774645
Unknown     66.431918
Divorced    66.750000
Single      67.032285
Name: Total_Trans_Ct, dtype: float64

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)

## Which is the average transactions amount per education level?

Sort the results in descending order.

In [17]:
df.groupby('Education_Level')['Total_Trans_Amt'].mean().sort_values(ascending=False)

Education_Level
Post-Graduate    4400.571429
Uneducated       4347.237958
Unknown          4258.104225
High School      4245.541843
Graduate         4200.481200
College          4049.073404
Doctorate        3990.149289
Name: Total_Trans_Amt, dtype: float64

![orange-divider](https://user-images.githubusercontent.com/7065401/92672455-187a5f80-f2ef-11ea-890c-40be9474f7b7.png)